package kz.my.kazakh.stemmer.morphology;

/**
 * Падежи казахского языка.
 * Created by IntelliJ IDEA.
 * User: danik
 * Date: 08.04.2009
 * Time: 17:24:26
 */
public enum Case {
    /** Атау септік - именительный падеж (кто, что )*/
    ATAU("Атау септік"),
    /** Ілік септік - притяжательный падеж (чей, чья, чье)*/
    ILIK("Ілік септік"),
    /** Барыс септік - направительно-дательный падеж (кому, для кого, чему, для чего, почему, куда)*/
    BARYS("Барыс септік"),
    /** Табыс септік - винительный падеж (кого, что)*/
    TABYS("Табыс септік"),
    /** Жатыс септік - местный падеж (у кого, у чего, где)*/
    JATYS("Жатыс септік"),
    /** Шығыс септік - исходный падеж (от кого, из чего, откуда) */
    SHYGYS("Шығыс септік"),
    /** Көмектес септік - творительный падеж (кем, чем) */
    KOMEKTES("Көмектес септік");

    protected String message;


    Case(String message) {
        this.message = message;
    }

    public String getMessage() {
        return message;
    }
}
